#include "Yaw_task.h"
#include "PID.h"
//================================================YAW轴电机控制任务================================================//

//	此文件是三云台控制任务，基于一级云台上的C板坐标系来解算二级云台的坐标
//	两个头用的CAN2,ID是1和2

//================================================全局变量================================================//


//================================================函数================================================//

//初始化PID参数
static void Yaw_init();	

//每次循环初始化
static void Yaw_loop_init();

//获取C板IMU值
static void Yaw_read_imu();

//================================================YAW轴控制主函数================================================//
void Yaw_task(void const *pvParameters)
{
  //参数初始化设置
	Yaw_init();
	osDelay(3000);
	
	
	//循环任务运行
  for(;;)
  {
		//Yaw_loop_init();//循环初始化
		Yaw_read_imu();//获取Imu角度

    osDelay(1);
  }

}

//================================================YAW轴PID参数初始化================================================//
static void Yaw_init()
{
	pid_init(&motor_pid_can_2[0],80,0.001,0,30000,30000);
	pid_init(&motor_pid_sita_can_2[0],5,0,3,30000,30000);
	pid_init(&motor_pid_can_2[1],80,0.001,0,30000,30000);
	pid_init(&motor_pid_sita_can_2[1],5,0,3,30000,30000);
}

//================================================YAW轴角度读取===============================================//
static void Yaw_read_imu()
{

}